In [1]:
#
import pandas as pd
import numpy as np 
#from IPython.display import display

In [2]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head()

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1
3   4  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0   1
4   5  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0   1

In [3]:
names = ['Id', 'RI', 'Na', 'Mg', 'Al', 'Si', 'K', 'Ca', 'Ba', 'Fe', 'Class']
data.columns = names
data = data.drop(columns = ['Id'])
data.head()

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.0      1
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.0      1

In [4]:
data['Class'].replace({1:'building_windows_float_processed',
2:'building_windows_non_float_processed', 3:'vehicle_windows_float_processed', 4:'vehicle_windows_non_float_processed', 5:'containers', 6:'tableware', 7:'headlamps'}, inplace= True)
data['Class'].value_counts()

building_windows_non_float_processed    76
building_windows_float_processed        70
headlamps                               29
vehicle_windows_float_processed         17
containers                              13
tableware                                9
Name: Class, dtype: int64

In [5]:
for col in data.columns:
    fr = np.random.randint(5,10)/100
    data.loc[data.sample(frac=fr).index, col] = np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      195 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      203 non-null    float64
 4   Si      197 non-null    float64
 5   K       199 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      203 non-null    float64
 9   Class   197 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [6]:
#Visualization
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      195 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      203 non-null    float64
 4   Si      197 non-null    float64
 5   K       199 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      203 non-null    float64
 9   Class   197 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [7]:
data.describe()

,RI,Na,Mg,Al,Si,K,Ca,Ba,Fe
count,201.000000,195.000000,195.000000,203.000000,197.000000,199.000000,203.000000,199.000000,203.000000
mean,1.518332,13.409538,2.685026,1.443350,72.665584,0.500151,8.964138,0.183568,0.058030
std,0.003033,0.820523,1.421396,0.505813,0.787545,0.671314,1.454141,0.512358,0.097742
min,1.511150,10.730000,0.000000,0.290000,69.810000,0.000000,5.430000,0.000000,0.000000
25%,1.516530,12.895000,2.140000,1.185000,72.280000,0.120000,8.225000,0.000000,0.000000
50%,1.517680,13.300000,3.480000,1.360000,72.830000,0.550000,8.600000,0.000000,0.000000
75%,1.519160,13.820000,3.590000,1.630000,73.100000,0.605000,9.205000,0.000000,0.100000
max,1.533930,17.380000,3.980000,3.500000,75.410000,6.210000,16.190000,3.150000,0.510000

In [8]:
data['Class'].describe()

count                                      197
unique                                       6
top       building_windows_non_float_processed
freq                                        73
Name: Class, dtype: object

In [11]:
display(data['Class'].value_counts())
display(data['Class'].describe())

building_windows_non_float_processed    73
building_windows_float_processed        65
headlamps                               24
vehicle_windows_float_processed         16
containers                              11
tableware                                8
Name: Class, dtype: int64

count                                      197
unique                                       6
top       building_windows_non_float_processed
freq                                        73
Name: Class, dtype: object